/* 
  Localizable.strings
  ownCloudSDK

  Created by Felix Schwarz on 03.03.18.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/* Item property names */
"itemProperty.lastModified" = "آخر تعديل";
"itemProperty.isFavorite" = "المفضلة";
"itemProperty.localAttributes" = "السمات المحلية";

/* Connection Progress */
"Connecting…" = "جارٍ الاتصال…";
"Authenticating…" = "جارٍ المصادقة…";
"Error" = "خطأ";
"Fetching user information…" = "جارٍ إحضار معلومات المستخدم…";
"Connected" = "متصل";

"Retrieving thumbnail…" = "استيراد الصورة المُصغرة…";

"Cancel" = "إلغاء";
"Proceed" = "متابعة";
"OK" = "تم";

/* Connection status */
"Offline" = "غير متصل";
"Offline (no WiFi connection)" = "غير متصل (اتصال WiFi غير موجود)";
"Server down for maintenance" = "الخادم معطل للصيانة";
"Online" = "متصل";

/* Delete */
"%@ changed on the server. Really delete it?" = "%@ تم التغيير في الخادم. هل تريد الحذف بالتأكيد؟";
"%@ has changed on the server since you requested its deletion." = "%@ تم التغيير في الخادم منذ أن طلبت الحذف.";
"Delete" = "حذف";

"%@ couldn't be deleted" = "%@ تعذر الحذف";
"Please check if you have sufficient permissions to delete %@." = "يُرجى التحقق إذا كان لديك أذونات كافية لحذف %@.";

/* Copy / Move */
"Operation forbidden" = "العملية ممنوعة";
"%@ can't be copied to %@." = "%@ لا يمكن النسخ إلى %@.";
"%@ can't be moved to %@." = "%@ لا يمكن النقل إلى %@.";

"%@ not found" = "%@ غير موجود";
"%@ wasn't found at %@." = "%@ لم يتم العثور عليه في %@.";

"The target directory %@ doesn't seem to exist." = "الدليل المستهدف %@ غير موجود.";

"%@ already exists" = "%@ موجود بالفعل";
"Couldn't copy %@ to %@, because an item called %@ already exists there." = "لا يمكن نسخ %@ إلى %@، لأن هناك عنصر يُسمى %@ موجود بالفعل.";
"Couldn't move %@ to %@, because an item called %@ already exists there." = "لا يمكن نقل %@ إلى %@، لأن هناك عنصر يُسمى %@ موجود بالفعل.";

"Insufficient permissions" = "الأذونات غير كافية";
"%@ can't be copied to %@." = "%@ لا يمكن النسخ إلى %@.";
"%@ can't be moved to %@." = "%@ لا يمكن النقل إلى %@.";

"%@ not found on the server" = "%@ لم يتم العثور على الخادم";
"%@ may have been renamed, moved or deleted remotely." = "%@ قد يكون تم إعادة التسمية أو النقل أو الحذف عن بُعد.";

"Error copying %@" = "خطأ في النسخ %@";
"Error moving %@" = "خطأ في النقل %@";

/* Download */
"Downloading %@…" = "جارِ تنزيل %@…";

/* Move/Rename/Copy */
"Renaming %@ to %@…" = "جارِ إعادة تسمية %@ إلى %@…";
"Moving %@ to %@…" = "جارِ النقل %@ إلى %@…";
"Copying %@ to %@…" = "جارِ النسخ %@ إلى %@…";

/* Create folder */
"Creating folder %@…" = "جارِ إنشاء مجلد %@…";

/* Delete */
"Deleting %@…" = "جارِ حذف %@…";

/* Retrieving file list */
"Retrieving file list for %@…" = "جارِ استرداد قائمة الملف لـ %@…";

/* Update */
"\"%@\" metadata for %@ couldn't be updated" = "تعذر تحديث \"%@\" بيانات تعريف%@";
"Update failed with status code %d" = "تعذر التحديث بواسطة رمز الحالة %d";
"Error updating %@ metadata" = "خطأ في تحديث ملفات تعريف %@";

/* Logging */
"Standard error output" = "خطأ قياسي في الإخراج";
"Log file" = "ملف السجل";

/* Errors */
"Server doesn't seem to support any authentication method supported by this app." = "يبدو أن الخادم لا يدعم أي وسيلة مصادقة يعتمدها التطبيق.";
"This server runs an unsupported version (%@). Version %@ or later is required by this app." = "يستخدم هذا الخادم إصدار غير مدعم (%@). إصدار %@ أو أحدث مطلوب لهذا التطبيق.";

/* DAV Errors */
// OCDAVErrorServiceUnavailable
"Server down for maintenance." = "الخادم معطل للصيانة.";

/* OC Errors */
"%@ (error %ld, %@)" = "%@ (خطأ %ld, %@)";
"%@ (error %ld)" = "%@ (خطأ %ld)";

// OCErrorInternal
"Internal error." = "خطأ داخلي.";

// OCErrorInsufficientParameters
"Insufficient parameters." = "معلمات غير كافية.";

// OCErrorAuthorizationFailed
"Authorization failed." = "تعذر إجراء المصادقة.";

// OCErrorAuthorizationRedirect
"Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL." = "تعذر إجراء المصادقة لأن الخادم أعاد إعادة توجيه. قد تنجح المصادقة حين تتم إعادة المحاولة باستخدام عنوان URL المُعاد توجيهه.";

// OCErrorAuthorizationNoMethodData
"Authorization failed because no secret data was set for the authentication method." = "تعذر إجراء المصادقة لأنه لم يتم تعيين بيانات خاصة لوسيلة المصادقة.";

// OCErrorAuthorizationMissingData
"Authorization failed because data was missing from the secret data for the authentication method." = "تعذر إجراء المصادقة لأن البيانات مفقودة من البيانات السرية لوسيلة المصادقة.";

// OCErrroAuthorizationCancelled
"Authorization was cancelled by the user." = "رفض المستخدم المصادقة.";

// OCErrorRequestURLSessionTaskConstructionFailed
"Construction of URL Session Task failed." = "تعذر إنشاء مهمة جلسة URL.";

// OCErrorNewerVersionExists
"A newer version already exists." = "يتوفر إصدار أحدث بالفعل.";

// OCErrorRequestCancelled
"Request was cancelled." = "تم إلغاء الطلب.";

// OCErrorRequestRemovedBeforeScheduling
"Request was removed before scheduling." = "تمت إزالة الطلب قبل الجدولة.";

// OCErrorRequestServerCertificateRejected
"Request was cancelled because the server certificate was rejected." = "تم إلغاء الطلب لأنه تم رفض شهادة الخادم.";

// OCErrorRequestDroppedByURLSession
"Request was dropped by the NSURLSession." = "تم إسقاط الطلب بواسطة NSURLSession.";

// OCErrorRequestCompletedWithError
"Request completed with error." = "تم استكمال الطلب مع وجود خطأ.";

// OCErrorRequestURLSessionInvalidated
"Request couldn't be scheduled because the underlying URL session has been invalidated." = "لا يمكن جدولة الطلب لأن جلسة URL الرئيسية أصبحت غير صالحة.";

// OCErrorException
"An exception occured." = "حدث استثناء.";

// OCErrorResponseUnknownFormat
"Response was in an unknown format." = "ظهرت الاستجابة في تنسيق غير معروف.";

// OCErrorServerDetectionFailed
"Server detection failed, i.e. when the server at a URL is not an ownCloud instance." = "تعذر كشف الخادم، مثال، حين لا يكون الخادم على URL مثيل لـ ownCloud.";

// OCErrorServerTooManyRedirects
"Server detection failed because of too many redirects." = "تعذر كشف الخادم بسبب إعادة التوجيهات الكثيرة.";

// OCErrorServerBadRedirection
"Server redirection to bad/invalid URL." = "إعادة توجيه الخادم إلى عنوان URL غير سليم/غير صالح.";

// OCErrorServerVersionNotSupported
"This server version is not supported." = "إصدار هذا الخادم غير مدعم.";

// OCErrorServerNoSupportedAuthMethods
"Server doesn't seem to support any authentication method supported by this app." = "يبدو أن الخادم لا يدعم أي وسيلة مصادقة يعتمدها التطبيق.";

// OCErrorCertificateInvalid
"The certificate is invalid or contains errors" = "الشهادة غير صالحة أو تحتوي على أخطاء";

// OCErrorCertificateMissing
"No certificate was returned for a request despite this being a HTTPS connection (should never occur in production, but only if you forgot to provide a certificate during simulated responses to HTTPS requests)." = "لم يتم إرجاع أي شهادة لطلب ما، رغم كونه اتصال HTTPS (ولا يجب أن يحدث في الانتاج على الإطلاق، ولكن فقط إذا نسيت توفير شهادة خلال استجابات محاكاة إلى طلبات HTTPS).";

// OCErrorFeatureNotSupportedForItem
"This feature is not supported for this item." = "هذه الخاصية غير مدعمة لهذا العنصر.";

// OCErrorFeatureNotSupportedByServer
"This feature is not supported for this server (version)." = "هذه الخاصية غير مدعمة لهذا الخادم (إصدار).";

// OCErrorFeatureNotImplemented
"This feature is currently not implemented" = "هذه الخاصية غير مطبقة حاليًا";

// OCErrorItemNotFound
"The targeted item has not been found." = "لم يتم العثور على العنصر المستهدف.";

// OCErrorItemDestinationNotFound
"The destination item has not been found." = "لم يتم العثور على عنصر الوجهة.";

// OCErrorItemChanged
"The targeted item has changed." = "تم تغيير العنصر المستهدف.";

// OCErrorItemInsufficientPermissions
"The action couldn't be performed on the targeted item because the client lacks permissions." = "تعذر تنفيذ الإجراء على العنصر المستهدف لأنه لا توجد أذونات لدى العميل.";

// OCErrorItemOperationForbidden
"The operation on the targeted item is not allowed." = "غير مسموح بالعملية في العنصر المستهدف.";

// OCErrorItemAlreadyExists
"There already is an item at the destination of this action." = "هناك عنصر موجود بالفعل في جهة هذا الإجراء.";

// OCErrorItemNotAvailableOffline
"Item not available offline." = "العنصر غير متوفر دون اتصال.";

// OCErrorFileNotFound:
"File not found." = "الملف غير موجود.";

// OCErrorCancelled
"The operation was cancelled." = "تم إلغاء العملية.";

// OCErrorOutdatedCache
"An operation failed due to outdated cache information." = "تعذر إجراء العملية لأن معلومات ذاكرة التخزين المؤقتة قديمة.";

// OCErrorRunningOperation
"A running operation prevents execution." = "عملية جارية تحول دون التنفيذ.";
